Revit 2026 API

# EnergyDataSettingsExportCategory Property

---

Value is a category indicating which discipline model will be used for GreenBuildingXML export.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ExportCategory { get; set; }
```
```vb
Public Property ExportCategory As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ExportCategory {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ExportCategory : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The export category is neither OST_Rooms nor OST_MEPSpaces. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

OST_Rooms will use the architectural 3d rooms for export. OST_MEPSpaces will use the MEP 3d Spaces for export.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace